notes/cell_structure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cell Structure</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://www.haider.gq/base/style.css'/> 
<link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css' /> 
<link rel='preconnect' href='https://fonts.googleapis.com'> 
<link rel='preconnect' href='https://fonts.gstatic.com' crossorigin> 
<link href='https://fonts.googleapis.com/css2?family=Poppins:ital@1&family=Roboto&display=swap' rel='stylesheet'>
<meta name='keywords' content='development, coding, programming, linux, emacs, guix'>
<link rel='icon' type='image/x-icon' href='/base/favicon.png'>
<meta name='description' content="Haider Mirza's website">
</head>
<body>
<div id="preamble" class="status">
<div class='grid-container'>
      <div class='grid-item header'>

	<a href='https://www.haider.gq' class='Header_Title'>
	  <span class='Header_Haider-Mirza'>Haider Mirza</span>
	</a>
	<ul class='Header_links'>
	  <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
	  <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	  <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	</ul>
	<input type='search' class='Sidebar_Search' placeholder='Search Posts...'>
	</div>

	<div class='grid-item main'>
	  <input type='search' class='Main_Search' placeholder='Search Posts...'>
	      <div class='main-main'> <!-- The actual main part -->
</div>
<div id="content" class="content">
<h1 class="title">Cell Structure</h1>

<div id="outline-container-org72490f5" class="outline-2">
<h2 id="org72490f5">Eukaryotes and Prokaryotes</h2>
<div class="outline-text-2" id="text-org72490f5">
<p>
There are two main "types" of cell structure:
</p>

<ul class="org-ul">
<li>Eukaryotic cells which are found in plants, animals and fungi.</li>
<li>Prokaryotic cells which are found in Bacteria</li>
</ul>
</div>

<div id="outline-container-org8578ce6" class="outline-3">
<h3 id="org8578ce6">Comparing Cell Types</h3>
<div class="outline-text-3" id="text-org8578ce6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Eukaryotic cell</th>
<th scope="col" class="org-left">Prokaryotic cells</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Size</td>
<td class="org-left">Most are about 5&mu;m - 100&mu;m</td>
<td class="org-left">Most are about 0.2&mu;m - 2&mu;m</td>
</tr>

<tr>
<td class="org-left">Outer Layers of cell</td>
<td class="org-left">Cell membrane - surrounded by cell wall in plants and fungi</td>
<td class="org-left">Cell membrane - surrounded by cell wall</td>
</tr>

<tr>
<td class="org-left">Cell contents</td>
<td class="org-left">Cytoplasm, cell organelles include mitochondria, chloroplasts in plants and ribosomes</td>
<td class="org-left">Cytoplasm, ribosomes, no mitochondria or chloroplasts</td>
</tr>

<tr>
<td class="org-left">Genetic Material</td>
<td class="org-left">DNA in a nucleus - plasmids are found in a few simple eukaryotic organisms</td>
<td class="org-left">DNA is a single molecule, found free in the cytoplasm - additional DNA is found on one or more rings called plasmids</td>
</tr>

<tr>
<td class="org-left">Type of cell division</td>
<td class="org-left">Mitosis</td>
<td class="org-left">Binary fission</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgf882234" class="outline-2">
<h2 id="orgf882234">Links to this note</h2>
<div class="outline-text-2" id="text-orgf882234">
<ul class="org-ul">
<li><a href="./biology.html">Biology</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
</div>
		    </div>
		<div class='grid-item sidebar'>
		  <h2>Socials</h2>
		  <ul class='sidebar-socials'>
		    <li><a href='mailto:haider@haider.gq'><i class='fa-solid fa-envelope'></i> Email</a></li>
		    <li class='irc' onclick='alert('My Username is Haider,
You can find me in Libera.Chat on these channels:
- #tropin 
- #systemcrafters 
- #guix');'><i class='fa-solid fa-message'></i> IRC/Matrix</li>
		    <li><a href='https://www.github.com/Haider-Mirza'><i class='fa-brands fa-github'></i> Github</a></li>
		  </ul>
		  <h2>Projects</h2>
		  <ul class='sidebar-projects'>
		    <li><a href='https://www.github.com/Haider-Mirza/Spinter'> Spinter</a></li>
		  </ul>
		</div>
		<div class='grid-item footer'>
		  <p>Created by Haider Mirza with orgmode in emacs</p>
		</div>
	      </div>
</div>
</body>
</html>
